In [1]:
import pandas as pd

In [2]:
#csv 파일 로드
#pd.read_csv(파일의 경로, encoding = '')
#절대 경로 : C:/Users/admin/document/a.csv, https://www.google.com
#상대 경로 : ../../csv/a.csv

AAPL = pd.read_csv('../csv/AAPL.csv')

In [4]:
AAPL.head()

         Date      Open      High       Low     Close  Adj Close       Volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.410525  117258400.0
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.389106   43971200.0
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.360548   26432000.0
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.369472   21610400.0
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.380182   18362400.0

In [5]:
#json 파일 로드
df = pd.read_json('../csv/2019/201901_expense_list.json')

In [7]:
df.head(2)

,nid,title,url,dept_nm_lvl_1,dept_nm_lvl_2,dept_nm_lvl_3,dept_nm_lvl_4,dept_nm_lvl_5,exec_yr,exec_month,expense_budget,expense_execution,category,dept_nm_full,exec_dt,exec_loc,exec_purpose,target_nm,payment_method,exec_amount
0,17506661,2019년1월 국제교류담당관 업무추진비 내역,http://opengov.seoul.go.kr/public/17506661,서울시본청,기획조정실,국제교류담당관,,,2019,1,NaN,NaN,,기획조정실 국제교류담당관,2019-01-31 19:57,구이구이 서울특별시 중구 을지로 6,도시외교 기본계획 개선관련 연구용역 및 협력방안 논의 간담회,국제교류담당관 등 6명,카드,143000
1,17506661,2019년1월 국제교류담당관 업무추진비 내역,http://opengov.seoul.go.kr/public/17506661,서울시본청,기획조정실,국제교류담당관,,,2019,1,NaN,NaN,,기획조정실 국제교류담당관,2019-01-31 12:39,왕비집 시청무교점 서울특별시 중구 무교로 19,서울평화포럼 준비위원회 구성 및 향후 추진방향 논의,국제교류담당관 등 3명,카드,24000

In [10]:
#xml 불러오기
df_xml = pd.read_xml('../csv/2021/202101_expense_list.xml')

In [12]:
df_xml.tail(2)

,nid,title,url,dept_nm_lvl_1,dept_nm_lvl_2,dept_nm_lvl_3,dept_nm_lvl_4,dept_nm_lvl_5,exec_yr,exec_month,...,expense_execution,category,dept_nm_full,exec_dt,exec_loc,exec_purpose,target_nm,payment_method,exec_amount,bimok
4876,22241159,2021년 1월 사업소 상수도사업본부 중부수도사업소 요금과 업무추진비 - 부서운영,http://opengov.seoul.go.kr/public/22241159,사업소,상수도사업본부,중부수도사업소,요금과,None,2021,1,...,NaN,None,중부수도 요금과,2021-01-27 15:19,가메골에프엔비㈜(중구 남대문시장4길 42),부서 직원 교육 및 신년간담회,요금과 직원 20명,카드,64000,None
4877,22241159,2021년 1월 사업소 상수도사업본부 중부수도사업소 요금과 업무추진비 - 부서운영,http://opengov.seoul.go.kr/public/22241159,사업소,상수도사업본부,중부수도사업소,요금과,None,2021,1,...,NaN,None,중부수도 요금과,2021-01-22 00:00,추어탕(중구 다산로 75 3층),간부 신년간담회,소장외 3명,카드,36000,None

In [18]:
user_num = pd.read_csv('../csv/주민등록.csv',encoding = 'cp949') #'EUC-KR'

In [20]:
user_num.head(3)

,자치구코드(atdrc_code_se),자치구명(atdrc_nm),년월(년월),총인구수(tot_popltn_co),세대수(tot_hshld_co),세대당인구(hshld_popltn_avrg_co),남자인구수(male_popltn_co),여자인구수(female_popltn_co),적재일시(ldadng_dt)
0,금천구,11110,201907,228755,171426,2.44,319062,118352,2018-01-05 16:52:25
1,서대문구,11290,201607,153780,186744,2.12,75614,116393,2018-12-05 10:20:57
2,양천구,11740,201804,594315,61091,2.22,192817,307237,2020-11-03 10:50:11

In [23]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [24]:
df3 = pd.read_excel('../csv/2020/202001_expense_list.xlsx')

In [26]:
df3.head(2)

,nid,title,url,dept_nm_lvl_1,dept_nm_lvl_2,dept_nm_lvl_3,dept_nm_lvl_4,dept_nm_lvl_5,exec_yr,exec_month,expense_budget,expense_execution,category,dept_nm_full,exec_dt,exec_loc,exec_purpose,target_nm,payment_method,exec_amount
0,21789676,2020년 1월 사업소 서울식물원 시설운영과 업무추진비 - 부서운영,http://opengov.seoul.go.kr/public/21789676,사업소,서울식물원,시설운영과,NaN,NaN,2020,1,NaN,NaN,NaN,푸른도시국 서울식물원 시설운영과,2020-01-22 10:25,코코호도마곡나루역점(강서구 마곡중앙5로 6),부서 전출직원 간담회 비용,이형선 외 3인,카드,30000
1,21762080,2020년 1월 사업소 상수도사업본부 남부수도사업소 행정지원과 업무추진비 - 부서운영,http://opengov.seoul.go.kr/public/21762080,사업소,상수도사업본부,남부수도사업소,행정지원과,NaN,2020,1,NaN,NaN,NaN,남부수도사업소 행정지원과,2020-01-29 08:55,"㈜한국문화진흥(강남구 강남대로 636, 두원빌딩2층)",2020년도 1월 생일자 격려상품 구매,1월 직원 생일자 12명,카드,216720

In [29]:
#tsv 파일 로드
df4 = pd.read_csv('../csv/num_1/chipotle.tsv', sep = '\t')

In [31]:
df4.head(3)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39

#### 결측치
- dataframe에서 value가 존재하지 않는 공간
- NaN으로 표시

In [32]:
import numpy as np

In [34]:
data = [
    [1,2,np.nan,4,5],
    [1,np.nan,3,4,5],
    [1,2,3,np.nan,5]
]
col = ['s1','s2','s3','s4','s5']
df = pd.DataFrame(data, columns = col)

In [ ]:
df

   s1   s2   s3   s4  s5
0   1  2.0  NaN  4.0   5
1   1  NaN  3.0  4.0   5
2   1  2.0  3.0  NaN   5

In [53]:
df.info()

#결측치가 들어있다면 float 형태로 정해짐

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   s1      3 non-null      int64
 1   s2      2 non-null      float64
 2   s3      2 non-null      float64
 3   s4      2 non-null      float64
 4   s5      3 non-null      int64
dtypes: float64(3), int64(2)
memory usage: 252.0 bytes

In [56]:
df.isna().sum()

s1    0
s2    1
s3    1
s4    1
s5    0
dtype: int64

In [ ]:
print(df.isnull())
print('-----')

#컬럼 기준으로 알려줌
print(df.isnull().sum())
print('-----')

#인덱스 기준으로 알려줌. DataFrame 안에 sum()함수의 ㅁ개변수 axis
#0,rows(기본값) : 컬럼을 기준으로 데이터의 합
#1, cloumns : 인덱스를 기준으로 데이터의 합
print(df.isna().sum(axis = 'columns'))
print('-----')

print(df.isnull().sum().sum())

      s1     s2     s3     s4     s5
0  False  False   True  False  False
1  False   True  False  False  False
2  False  False  False   True  False
-----
s1    0
s2    1
s3    1
s4    1
s5    0
dtype: int64
-----
0    1
1    1
2    1
dtype: int64
-----
3

In [62]:
#결측치의 유무를 판단하는 함수
df.isna().any()

s1    False
s2     True
s3     True
s4     True
s5    False
dtype: bool

In [57]:
df.isna().mean()

s1    0.000000
s2    0.333333
s3    0.333333
s4    0.333333
s5    0.000000
dtype: float64

In [68]:
#결측치를 제거하는 함수
#결측치가 포함되어 있는 열, 행을 제거.
#기본값은 행을 제거

df.dropna(axis='columns')

   s1  s5
0   1   5
1   1   5
2   1   5

In [75]:
#결측치에 다른 값 대체
#df.fillna(data) : 결측치를 data로 대체
#method 매개변수
    #ffill : 앞의 행의 데이터로 대체
    #bfill : 뒤의 행의 데이터로 대체
    
    
df['s3'] = df['s3'].fillna(20)

In [76]:
df

   s1   s2    s3   s4  s5
0   1  2.0  20.0  4.0   5
1   1  NaN   3.0  4.0   5
2   1  2.0   3.0  NaN   5

In [79]:
df.fillna(method = 'bfill')

C:\Users\Owner\AppData\Local\Temp\ipykernel_5064\3673297803.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill')

   s1   s2    s3   s4  s5
0   1  2.0  20.0  4.0   5
1   1  2.0   3.0  4.0   5
2   1  2.0   3.0  NaN   5

#### 데이터프레임의 필터링
- 데이터프레임명.loc[ 인덱스의 조건, 컬럼의 조건 ]
    - 인덱스의 값을 기준으로 필터
    - 컬럼의 값을 기준으로 필터

- 데이터프레임명.iloc[ 인덱스의 위치, 컬럼의 위치 ]
    - 인덱스의 위치를 기준으로 필터
    - 컬럼의 위치를 기준으로 필터
    
- 데이터프레임명[컬럼명]
    - 특정 컬럼의 데이터를 확인
    - 결과가 Series 출력

- 데이터프레임명[ [ 컬럼명 ] ]
    - 특정 컬럼의 데이터를 확인
    - 결과가 DataFrame으로 출력

In [81]:
data = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
index = [1,4,7]
col = ['a','b','c']
df = pd.DataFrame(data,index=index,columns = col)
df

   a  b  c
1  1  2  3
4  4  5  6
7  7  8  9

In [ ]:
#loc 인덱스의 조건
df.loc[ [4] ]

   a  b  c
4  4  5  6

In [98]:
#loc 컬럼의 조건
df.loc[:,'a']

1    1
4    4
7    7
Name: a, dtype: int64

In [99]:
df['a']

1    1
4    4
7    7
Name: a, dtype: int64

In [108]:
#특정한 조건식에 맞춰서 데이터 필터
#a 컬럼의 데이터들 중에 3보다 큰 데이터만 확인
flag = df['a'] > 3
df.loc[flag]

   a  b  c
4  4  5  6
7  7  8  9

In [111]:
#특정한 조건식에 맞춰 컬럼 필터
#index 7에 데이터 중 8보다 큰 컬럼의 데이터 확인
flag2 = df.loc[7] > 8
df.loc[:,flag2]

   c
1  3
4  6
7  9

In [112]:
df.loc[flag,flag2]

   c
4  6
7  9

In [113]:
#iloc 인덱스의 조건
df.iloc[1]

a    4
b    5
c    6
Name: 4, dtype: int64

In [ ]:
#iloc 인덱스 기준 (위치)
df.iloc[[1]]

   a  b  c
4  4  5  6

In [ ]:
#iloc 컬럼 기준 (위치)
df.iloc[ : ,[2]]

   c
1  3
4  6
7  9

In [124]:
df.loc[4, 'b'] = 10
df

   a   b  c
1  1   2  3
4  4  10  6
7  7   8  9